# Напишите программу, которая считает сумму, произведение и степень двух чисел.
# Ввод: два целых числа, каждое на отдельной строке.
# Вывод: сумма, произведение и степень, в одну строку через пробел.

num1, num2 = int(input()), int(input())
print(num1+num2, num1*num2, num1**num2)
